app/controllers/movies_controller.rb

  def create
    userId = current_user.id
    @movie = Movie.create
    favorites = Favorite.create(
      user_id: userId,
      title: params[:Title],
      year: params[:Year],
      rated: params[:Rated],
      released: params[:Released],
      runtime: params[:Runtime],
      genre: params[:Genre],
      director: params[:Director],
      writer: params[:Writer],
      actors: params[:Actors],
      plot: params[:Plot],
      poster: params[:Poster],
      imdbRating: params[:imdbRating],
      imdbVotes: params[:imdbVotes],
      imdbID: params[:imdbID],
      response: params[:Response]
    )
---
INSERT INTO "movies" ("created_at", "search", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 21 Feb 2014 22:53:14 UTC +00:00], ["search", nil], ["updated_at", Fri, 21 Feb 2014 22:53:14 UTC +00:00]]
INSERT INTO "favorites" ("actors", "created_at", "director", "genre", "imdbID", "imdbRating", "imdbVotes", "plot", "poster", "rated", "released", "response", "runtime", "title", "updated_at", "user_id", "writer", "year") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def favorite
    #movies = current_user.favorites
    movies = Favorite.where(user_id: current_user.id)
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 1

  def destroy
    Favorite.delete(params[:id])
---
DELETE FROM "favorites" WHERE "favorites"."id" = 1